Revit 2026 API

# StructuralConnectionHandlerTypeUpdateCustomConnectionType Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void UpdateCustomConnectionType(
	StructuralConnectionHandler structuralConnectionHandler,
	IList<Reference> addReferences,
	IList<Reference> removeReferences
)
```
```vb
Public Shared Sub UpdateCustomConnectionType (
	structuralConnectionHandler As StructuralConnectionHandler,
	addReferences As IList(Of Reference),
	removeReferences As IList(Of Reference)
)
```
```cpp
public:
static void UpdateCustomConnectionType(
	StructuralConnectionHandler^ structuralConnectionHandler,
	IList<Reference^>^ addReferences,
	IList<Reference^>^ removeReferences
)
```
```fsharp
static member UpdateCustomConnectionType :
        structuralConnectionHandler : StructuralConnectionHandler *
        addReferences : IList<Reference> *
        removeReferences : IList<Reference> -> unit
```

#### Parameters

structuralConnectionHandler StructuralConnectionHandler

addReferences IListReference

removeReferences IListReference

#### Reference

StructuralConnectionHandlerType Class

Autodesk.Revit.DB.Structure Namespace